from math import sqrt as sqrt

while True:
    try:
        print('Дано квадратное уравнение вида ax\u00B2 + bx + c = 0.')
        a, b, c, = map(float, input('Введите в одной строке рациональные коэффициенты a, b и c: ').split())
    except ValueError:
        print('\nОшибка!')
        print('Возможно, проблема в недостаточном или избыточном количестве коэффициентов или неверном типе данных.')
        print('Повторите попытку\n')
    else:
        print()
        break

if a == 0:
    if b == 0:
        if c == 0:
            print('Уравнение имеет бесконечное количество решений: x ϵ (-∞;+∞)')
        if c != 0:
            print('Уравнение не имеет корней: x ϵ ∅')
    else:
        print('Уравнение имеет единственное решение: x =', -c / b)
else:
    D = b**2 - 4*a*c
    if D < 0:
        print('Уравнение не имеет корней: x ϵ ∅')
    elif D == 0:
        print('Уравнение имеет единственное решение: x =', -b / (2*a))
    else:
        d = sqrt(D)
        x1 = (-b - d) / (2 * a)
        x2 = (-b + d) / (2 * a)
        print('Уравнение имеет два решения: x\u2081 = {}, x\u2082 = {}'.format(x1, x2))
